# Splitting of Dataset

<h2> Importing Libraries </h2>

In [1]:
import pandas as pd
import numpy as np

<h2> Importing Dataset </h2>

In [7]:
df = pd.read_csv("Salary_Dataset_02.csv")
df.drop(columns=['Unnamed: 0'], inplace=True)
df.head()

   Australia  Canada  Dubai  USA   Salary  YearsExperience  Purchased
0        0.0     0.0    1.0  0.0  39343.0              1.1        0.0
1        0.0     1.0    0.0  0.0  46205.0              1.3        1.0
2        0.0     1.0    0.0  0.0  37731.0              1.5        0.0
3        0.0     1.0    0.0  0.0  43525.0              2.0        0.0
4        0.0     0.0    0.0  1.0  39891.0              2.2        0.0

In [41]:
df.head()

   Australia  Canada  Dubai  USA  Salary  YearsExperience  Purchased
0          0       0      1    0   39343              1.1          0
1          0       1      0    0   46205              1.3          1
2          0       1      0    0   37731              1.5          0
3          0       1      0    0   43525              2.0          0
4          0       0      0    1   39891              2.2          0

<h2> Dividing into Target and Predictor Variables </h2>

In [10]:
X = df.iloc[:, :-1]
y = df.iloc[:,-1]

<h2> Divide Data as Training Set and Testing Set </h2>

In [11]:
from sklearn.model_selection import train_test_split 

X_train, X_test, y_train, y_test=train_test_split(X,y,test_size=0.2, random_state=42)

In [15]:
y_test

27    1.0
15    0.0
23    1.0
17    0.0
8     1.0
9     0.0
Name: Purchased, dtype: float64